БухЭксп/InformationRegisters/CW_ШаблоныДокументовПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШаблоныДокументовПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РедактированиеОбщегоШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РедактированиеШаблонаДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РедактированиеМакросовШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_МакросыШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МакросыШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределеннаяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПредопреленныеФункцииШаблоновДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКДанным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЗначениеКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬРеквизитОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬМониторинговыйПараметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬМониторинговыйПараметрРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬФорматВыводаРеквизитаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ШаблоныДокументовСерверВызовСервера/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Элементы 	=  Форма.Элементы; 
	Объект 		=  Форма.Объект; 
	
	Если Не Объект.ЭтоГруппа Тогда
		мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_НазначенияШаблоновДокументов.Тип.Типы();
		
		Для Каждого ТипВладельца из мДоступныеТипы Цикл
			ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
			Элементы.НазначениеШаблона.СписокВыбора.Добавить(ИдентификаторОбъектаМетаданных, ИдентификаторОбъектаМетаданных.Синоним);
		КонецЦикла;
		
		Если Объект.Ссылка.Пустая() Тогда
			Если Не ЗначениеЗаполнено(Объект.НазначениеШаблона) 
				И Элементы.НазначениеШаблона.СписокВыбора.Количество() = 1 Тогда
				Объект.НазначениеШаблона = Элементы.НазначениеШаблона.СписокВыбора[0].Значение;	
			КонецЕсли;                       
		КонецЕсли;   
	КонецЕсли;
	
КонецПроцедуры          

Процедура ПриСозданииФормыСпискаНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы; 

	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_НазначенияШаблоновДокументов.Тип.Типы();
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
		Форма.СписокНазначений.Добавить(ИдентификаторОбъектаМетаданных, ИдентификаторОбъектаМетаданных.Синоним,,БиблиотекаКартинок.CW_Папка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдентификаторПоТексту(Знач Представление) Экспорт
	
	Идентификатор = "";
	БылРазделитель = Ложь;
	Для НомСимвола = 1 По СтрДлина(Представление) Цикл
		Символ = Сред(Представление, НомСимвола, 1);
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Символ) 
			И ПустаяСтрока(Идентификатор) Тогда
			// цифры в начале пропускаем
			Продолжить;
		КонецЕсли;
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Символ)) Тогда
			БылРазделитель = Истина;
		Иначе
			Если БылРазделитель Тогда
				БылРазделитель = Ложь;
				Символ = ВРег(Символ);
			КонецЕсли;
			Идентификатор = Идентификатор + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Идентификатор;

КонецФункции


Функция ЭтоГруппаПараметров(ПараметрШаблона) Экспорт
	Возврат ПараметрШаблона.ЭтоГруппа;
КонецФункции

Функция ПолучитьИдентификаторПараметра(ВыбраннаяСтрока) Экспорт
	Возврат "["+ВыбраннаяСтрока.Идентификатор+"]";
КонецФункции

Функция ПолучитьПараметрШаблона(Идентификатор, ОбъектПечати) Экспорт 
	
	НазначениеШаблона = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектПечати.Метаданные());	 
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_МакросыШаблоновДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_МакросыШаблоновДокументов КАК CW_МакросыШаблоновДокументов
	               |ГДЕ
	               |	CW_МакросыШаблоновДокументов.Идентификатор = &Идентификатор
	               |	И CW_МакросыШаблоновДокументов.НазначениеШаблона = &НазначениеШаблона
	               |	И CW_МакросыШаблоновДокументов.НеИспользуется = ЛОЖЬ
	               |	И CW_МакросыШаблоновДокументов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("НазначениеШаблона", НазначениеШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка =РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьЗначениеПараметра(ИдентификаторПараметра, ОбъектПечати) Экспорт  
	
	ПараметрШаблонаСсылка = ПолучитьПараметрШаблона(ИдентификаторПараметра, ОбъектПечати);
	
	Если ПараметрШаблонаСсылка = Неопределено Тогда
		Возврат "{Ошибка вычисления макроса: "+ ИдентификаторПараметра + "!}";
	КонецЕсли; 
	
	//Фиксированный текст(0), Значение реквизита/параметра (свойства)(1), Рассчитывается по формуле(2) 
	
	//Фиксированный текст
	Если ПараметрШаблонаСсылка.Рассчитывается = 0 Тогда
		Возврат СокрЛП(ПараметрШаблонаСсылка.Формула);
	КонецЕсли;
	
	//Значение параметра (свойства)
	Если ПараметрШаблонаСсылка.Рассчитывается = 1 Тогда 
		
		ПолученноеЗначение = Справочники.CW_МакросыШаблоновДокументов.ПолучитьЗначениеПараметраОбъекта(ОбъектПечати, ПараметрШаблонаСсылка);  
		
		Если ПолученноеЗначение <> Неопределено Тогда
			Если Не ПустаяСтрока(ПараметрШаблонаСсылка.ФорматВывода) Тогда
				ПолученноеЗначение = Формат(ПолученноеЗначение, ПараметрШаблонаСсылка.ФорматВывода);	
			КонецЕсли;                                      
		КонецЕсли;
		
		Возврат ПолученноеЗначение;	
		
	КонецЕсли;

	//Рассчитывается по формуле
	Если ПараметрШаблонаСсылка.Рассчитывается = 2 Тогда  
		
		ДанныеФормулы 		= ПолучитьДанныеДляРасчетаФункции(ПараметрШаблонаСсылка.Формула, ОбъектПечати);
		ПоказателиФормулы	= ДанныеФормулы.ПоказателиФормулы;
		
		Попытка    
			Возврат	Вычислить(ДанныеФормулы.Формула);
		Исключение 
			ВызватьИсключение "Ошибка получения значения параметра макета "+ИдентификаторПараметра;
		КонецПопытки;  
		
	КонецЕсли;  
	
	Возврат  "";
	
КонецФункции  

Функция ПолучитьДанныеДляРасчетаФункции(Знач Формула, ОбъектПечати) 
	
	ПоказателиФормулы = Новый Структура;
	ПоказателиФормулы.Вставить("ОбъектПечати", ОбъектПечати);
	
	НазначениеШаблона	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ОбъектПечати));
	МассивПоказателей 	= CW_ШаблоныДокументовФункцииВызовСервераПовторноеИспользование.ПолучитьИдентификаторыПараметровШаблона(НазначениеШаблона);
	
	РазделителиФормулы 		= " +-/*?=<>()," + Символы.ВК + Символы.ВТаб + Символы.НПП + Символы.ПС + Символы.ПФ + Символы.Таб;
	ЗарезервированныеСлова 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ЦЕЛ,INT,ОКР,ROUND,МАКС,MAX,МИН,MIN,И,ИЛИ,НЕ,OR,AND,NOT");
	
	Слова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Формула, РазделителиФормулы);
	Для Каждого Слово Из Слова Цикл
		// Это число
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрЗаменить(Слово, ".", "")) Тогда
			Продолжить;
		КонецЕсли;
		// Это зарезервированное слово.
		Если ЗарезервированныеСлова.Найти(ВРег(Слово)) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		// Это должен быть показатель 
		Если МассивПоказателей.Найти(СтрЗаменить(Слово, ".", "")) <> Неопределено Тогда
			ЗначениеПоказателя 	= ПолучитьЗначениеПараметра(Слово, ОбъектПечати);
			
			ПоказателиФормулы.Вставить(Слово, ЗначениеПоказателя);  
			
			Формула = СтрЗаменить(Формула, Слово , "ПоказателиФормулы."+Слово);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляРасчета = Новый Структура;
	ДанныеДляРасчета.Вставить("Формула", 			Формула);
	ДанныеДляРасчета.Вставить("ПоказателиФормулы", 	ПоказателиФормулы);
	
	Возврат ДанныеДляРасчета;

КонецФункции


Функция ПолучитьПравоРедактированияШаблона(Шаблон, НазначениеШаблона) Экспорт

	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если CW_ПраваДоступа.ЭтоПолноправныйПользователь(Пользователь,Истина) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если Не ЗначениеЗаполнено(ГруппаПользователя) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ГруппаПользователя = ПредопределенноеЗначение("Справочник.CW_ГруппыПользователей.Администраторы") 
		ИЛИ  ГруппаПользователя.ПолныеПрава Тогда
		Возврат Истина;     
	КонецЕсли;       
	
	СоответствиеПрав = РегистрыСведений.CW_ШаблоныДокументовПраваДоступа.ПолучитьПравоДостпаГруппыПользователя(ГруппаПользователя, НазначениеШаблона);
	
	ПравоДоступно = СоответствиеПрав.Получить(ТипЗнч(Шаблон));
	ПравоДоступно = ?(ПравоДоступно=Неопределено, Ложь, ПравоДоступно);
	
	Возврат ПравоДоступно;
	
КонецФункции

Функция ПолучитьТаблицаПравДоступа(ГруппаПользователя) Экспорт 
	
	ТаблицаПравГруппы = РегистрыСведений.CW_ШаблоныДокументовПраваДоступа.ПолучитьПраваДостпаГруппыПользователей(ГруппаПользователя);
	
	ТаблицаПрав = Новый ТаблицаЗначений;
	ТаблицаПрав.Колонки.Добавить("Наименование",  					Новый ОписаниеТипов("Строка"));
	ТаблицаПрав.Колонки.Добавить("ИдентификаторОбъектаМетаданных",  Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	ТаблицаПрав.Колонки.Добавить("РедактированиеШаблонаДокумента",	Новый ОписаниеТипов("Булево"));
	ТаблицаПрав.Колонки.Добавить("РедактированиеОбщегоШаблона",		Новый ОписаниеТипов("Булево")); 
	ТаблицаПрав.Колонки.Добавить("РедактированиеМакросовШаблона",	Новый ОписаниеТипов("Булево")); 
	
	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_НазначенияШаблоновДокументов.Тип.Типы();
	
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);  
		
		НоваяСтрока = ТаблицаПрав.Добавить();
		НоваяСтрока.Наименование 					= СокрЛП(ИдентификаторОбъектаМетаданных.Синоним);
		НоваяСтрока.ИдентификаторОбъектаМетаданных  = ИдентификаторОбъектаМетаданных; 
		
		Отбор = Новый Структура("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
		мСтроки = ТаблицаПравГруппы.НайтиСтроки(Отбор); 
		
		Если мСтроки.Количество() > 0 Тогда
			НоваяСтрока.РедактированиеШаблонаДокумента  =  мСтроки[0].РедактированиеШаблонаДокумента;
			НоваяСтрока.РедактированиеОбщегоШаблона	    =  мСтроки[0].РедактированиеОбщегоШаблона;
			НоваяСтрока.РедактированиеМакросовШаблона   =  мСтроки[0].РедактированиеМакросовШаблона;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПрав;
	
КонецФункции

// По имени параметра определяет порядковый номер падежа (от 1 до 6), к которому должен быть приведен параметр.
//
Функция ПадежПоИмениПараметра(Знач ИмяПараметра) Экспорт
	
	ИмяПараметра = ВРег(ИмяПараметра);
	ПорядковыйНомерПадежа = 1;
	
	Если ПустаяСтрока(ИмяПараметра) Тогда
		Возврат ПорядковыйНомерПадежа;
	КонецЕсли;
	
	Если ИмяПараметра = "РОДИТЕЛЬНЫЙ" Тогда
		ПорядковыйНомерПадежа = 2;
	ИначеЕсли ИмяПараметра =  "ДАТЕЛЬНЫЙ" Тогда
	    ПорядковыйНомерПадежа = 3;
	ИначеЕсли ИмяПараметра =  "ВИНИТЕЛЬНЫЙ" Тогда
	    ПорядковыйНомерПадежа = 4;
	ИначеЕсли ИмяПараметра =  "ТВОРИТЕЛЬНЫЙ" Тогда
	    ПорядковыйНомерПадежа = 5;
	ИначеЕсли ИмяПараметра =  "ПРЕДЛОЖНЫЙ" Тогда
	    ПорядковыйНомерПадежа = 6;
	КонецЕсли;
	
	Возврат ПорядковыйНомерПадежа;
	
КонецФункции

Процедура ЗаполнитьФорматированныйДокументПоШаблону(ПараметрыПроцедуры, АдресРезульата=Неопределено) Экспорт   

	ЦветФонаЗаменяемогоПараметра	= ПечатьДоговоров.ЦветФонаЗаменяемогоПараметра(); 
	ЦветПоУмолчанию 				= ПечатьДоговоровКлиентСервер.ЦветФонаПоУмолчанию();
	
	ДанныеШаблона = ПараметрыПроцедуры.ДанныеШаблона;
	
	ФорматированныйДокумент = новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML, ДанныеШаблона.Вложения);

	ЭлементыКОбнулению = Новый Массив;
	
	ОбластьНачалоПараметра = ФорматированныйДокумент.НайтиТекст("[");
	Пока ОбластьНачалоПараметра <> Неопределено Цикл
		
		ОбластьКонецПараметра = ФорматированныйДокумент.НайтиТекст("]", ОбластьНачалоПараметра.ЗакладкаНачала);
		Если ОбластьКонецПараметра = Неопределено Тогда
			// Для параметра не задана закрывающая скобка и он продолжается до конца текста, поэтому выходим из цикла.
			Прервать;
		КонецЕсли;
		
		МассивЭлементов = ФорматированныйДокумент.СформироватьЭлементы(ОбластьНачалоПараметра.ЗакладкаНачала, ОбластьКонецПараметра.ЗакладкаКонца);
		
		Сч = 0;
		ДлинаДобавленногоТекста = 0;
		Пока Сч < МассивЭлементов.Количество() Цикл
			ЭлементДокумента = МассивЭлементов[Сч];
			
			Если ТипЗнч(ЭлементДокумента) <> Тип("ТекстФорматированногоДокумента") Тогда
				Сч = Сч + 1;
				Продолжить;
			КонецЕсли;
			
			ИмяПараметра = ЭлементДокумента.Текст;
			
			// Возможно, что из-за форматирования текст параметра разбился на несколько html-элементов
			// и надо собрать их в один
			Пока Сч < МассивЭлементов.Количество() - 1
				И Прав(ИмяПараметра, 1) <> "]" Цикл
				
				СледующийЭлементДокумента = МассивЭлементов[Сч + 1];
				Если ТипЗнч(СледующийЭлементДокумента) <> Тип("ТекстФорматированногоДокумента") Тогда
					Прервать;
				КонецЕсли;
				
				ИмяПараметра = ИмяПараметра + СледующийЭлементДокумента.Текст;
				Сч = Сч + 1;
				
				ЭлементыКОбнулению.Добавить(СледующийЭлементДокумента);
	
			КонецЦикла;
			
			Если Лев(ИмяПараметра, 1) = "[" Тогда
				ИмяПараметра = Сред(ИмяПараметра, 2);
			КонецЕсли;
			Если Прав(ИмяПараметра, 1) = "]" Тогда
				ИмяПараметра = Сред(ИмяПараметра, 1, СтрДлина(ИмяПараметра) - 1);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяПараметра) Тогда
				Значение = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьЗначениеПараметра(ИмяПараметра, ПараметрыПроцедуры.ОбъектПечати);  
				
				Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
					
					ЭлементДокумента.Текст 	= ""; 
					ЗакладкаНачала 			= ЭлементДокумента.ЗакладкаНачала; 
					
					Картинка = Новый Картинка(Значение);
					ДобавленныйЭлемент = ФорматированныйДокумент.Вставить(ЗакладкаНачала, Картинка, Тип("КартинкаФорматированногоДокумента"));  
					
					РазмерыРиснука = Неопределено;
					РазмерыКартинокШаблонов = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьРазмерыКартинок();
					Если РазмерыКартинокШаблонов <> Неопределено Тогда
						РазмерыКартинокШаблонов.Свойство(ИмяПараметра+"HTML", РазмерыРиснука); 
					КонецЕсли;
					
					Если РазмерыРиснука <> Неопределено Тогда 
						ДобавленныйЭлемент.Ширина =  РазмерыРиснука.Ширина;
						ДобавленныйЭлемент.Высота =  РазмерыРиснука.Высота;
					КонецЕсли;
					
				Иначе
					ЭлементДокумента.Текст = СокрЛП(Значение);
				КонецЕсли;
				
			Иначе
			КонецЕсли;
			
			// Заменяем цвет фона по умолчанию
			Если ЭлементДокумента.ЦветФона = ЦветФонаЗаменяемогоПараметра Тогда
				ЭлементДокумента.ЦветФона = ЦветПоУмолчанию;
				ПоследнийТекстовыйЭлемент = ЭлементДокумента;
			КонецЕсли;
			
			Для Каждого Элемент Из ЭлементыКОбнулению Цикл
				Элемент.Текст = "";
			КонецЦикла;
	
			Сч = Сч + 1;
			
		КонецЦикла; 
		
		// Ищем следующий параметр
		ОбластьНачалоПараметра = ФорматированныйДокумент.НайтиТекст("[", ОбластьНачалоПараметра.ЗакладкаНачала);
		
	КонецЦикла; 
	
	ПоместитьВоВременноеХранилище(ФорматированныйДокумент, АдресРезульата);

КонецПроцедуры   

Функция ЗаполнитьMXLДокументПоШаблону(ПараметрыПроцедуры) Экспорт   
			
	Макет 			= ПараметрыПроцедуры.Макет;		
	ОбъектПечати 	= ПараметрыПроцедуры.ОбъектПечати;
			
	НазначениеШаблона 		= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ОбъектПечати)); 
	МассивКартинкиШаблонов 	= Справочники.CW_ПредопреленныеФункцииШаблоновДокументов.ПолучитьИменаПредопределенныхКартинок();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_МакросыШаблоновДокументов.Ссылка КАК Ссылка,
	               |	CW_МакросыШаблоновДокументов.Идентификатор КАК Идентификатор,
	               |	CW_МакросыШаблоновДокументов.Формула КАК Формула,
	               |	CW_МакросыШаблоновДокументов.ПредопределеннаяФункция КАК ПредопределеннаяФункция
	               |ИЗ
	               |	Справочник.CW_МакросыШаблоновДокументов КАК CW_МакросыШаблоновДокументов
	               |ГДЕ
	               |	CW_МакросыШаблоновДокументов.НеИспользуется = ЛОЖЬ
	               |	И CW_МакросыШаблоновДокументов.НазначениеШаблона = &НазначениеШаблона
	               |	И CW_МакросыШаблоновДокументов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НазначениеШаблона", НазначениеШаблона);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();  
	
	Пока Выборка.Следующий() Цикл  
		
		Если МассивКартинкиШаблонов.Найти(Выборка.ПредопределеннаяФункция) <> Неопределено Тогда
			
			//ЭтоКартинка
			Если Макет.Рисунки.Количество() > 0 Тогда  
				Рисунок = СуществуетКартикаМакета(Макет, Выборка.Идентификатор);
				Если Рисунок = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ДвоичныеДанные = Вычислить(Выборка.Формула);
				Если ДвоичныеДанные <> Неопределено Тогда
					Рисунок.Картинка = Новый Картинка(ДвоичныеДанные); 
					
					Рисунок.ГраницаСверху = Ложь;
					Рисунок.ГраницаСлева  = Ложь;
					Рисунок.ГраницаСнизу  = Ложь;
					Рисунок.ГраницаСправа = Ложь;
				Конецесли; 
			КонецЕсли;
			
		Иначе  
			
			Идентификатор 	 = "["+Выборка.Идентификатор+"]"; 
			НайденнаяОбласть = Макет.НайтиТекст(Идентификатор);
			Пока НайденнаяОбласть <> Неопределено Цикл 
				Значение 				= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьЗначениеПараметра(Выборка.Идентификатор, ОбъектПечати);
				НайденнаяОбласть.Текст 	= СтрЗаменить(НайденнаяОбласть.Текст, Идентификатор, СокрЛП(Значение));
				НайденнаяОбласть 		= Макет.НайтиТекст(Идентификатор);
			КонецЦикла; 
			
		КонецЕсли;
	КонецЦикла;  
	
	//Подпись, Печать и Штрихкод  
	Если Макет.Рисунки.Количество() > 0 Тогда  
		
		Для Каждого КартинкаМакета из Макет.Рисунки Цикл
			
			Если СтрНачинаетсяС(КартинкаМакета.Имя, "ПечатьОрганизации") Тогда
				ДвоичныеДанные = CW_ШаблоныДокументовФункции.НашиРеквизиты_ПечатьОрганизации(ОбъектПечати);
			КонецЕсли;     
			
			Если СтрНачинаетсяС(КартинкаМакета.Имя, "РуководительПодпись") Тогда
				ДвоичныеДанные = CW_ШаблоныДокументовФункции.НашиРеквизиты_РуководительПодпись(ОбъектПечати);
			КонецЕсли; 
			
			Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
				УстановитьДанныеКартинкиМакета(ДвоичныеДанные, КартинкаМакета);
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	//Подпись, печать и Штрихкод
	
	Возврат Макет;
//	ПоместитьВоВременноеХранилище(Макет, АдресРезульата);
	
КонецФункции  

 Процедура УстановитьДанныеКартинкиМакета(Знач ДвоичныеДанные, Знач КартинкаМакета)
	
	КартинкаМакета.Картинка = Новый Картинка(ДвоичныеДанные); 
	
	КартинкаМакета.ГраницаСверху = Ложь;
	КартинкаМакета.ГраницаСлева  = Ложь;
	КартинкаМакета.ГраницаСнизу  = Ложь;
	КартинкаМакета.ГраницаСправа = Ложь;

КонецПроцедуры 

//Работа с картинками
Функция ПолучитьРазмерыКартинок() Экспорт    
	
	ХранилищеРазмеров	= Константы.CW_МасштабКартинокШаблонов.Получить();  
	СтруктураРазмеров	= ХранилищеРазмеров.Получить();
	
	Возврат СтруктураРазмеров;
	
КонецФункции 

Функция ПолучитьИменаМакросовРисунков()  Экспорт

	Массив = Новый Массив;
	Массив.Добавить("[РуководительПодпись]");
	Массив.Добавить("[ПечатьОрганизации]");
	
	Возврат Массив; 
	
КонецФункции  

Функция ПолучитьИменаРисунков()  Экспорт

	Массив = Новый Массив;
	Массив.Добавить("РуководительПодпись");
	Массив.Добавить("ПечатьОрганизации");
	
	Возврат Массив; 
	
КонецФункции  

Функция СуществуетКартикаМакета(Макет, ИмяКартинки) Экспорт
	
	Попытка
		Возврат Макет.Рисунки[ИмяКартинки];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ДанныеКартинкиHTMLДокумента(Картинка) Экспорт
	
	
	
ПолучитьИзВременногоХранилища(Картинка);

Возврат "";
	
	
КонецФункции

Функция ПолучитьИсходныеРазмерыКартинкиXML(ТабличныйДокумент, ИмяКартикни) Экспорт
	
	РазмерыРиснука = Неопределено;
	РазмерыКартинокШаблонов = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьРазмерыКартинок(); 
	Если РазмерыКартинокШаблонов <> Неопределено Тогда
		РазмерыКартинокШаблонов.Свойство(ИмяКартикни, РазмерыРиснука);
	КонецЕсли;
	
	Если РазмерыРиснука <> Неопределено Тогда 
		Возврат РазмерыРиснука;
	КонецЕсли; 
	
	//Считаем исходными текущие данные картикни
	Рисунок = CW_ШаблоныДокументовСерверВызовСервера.СуществуетКартикаМакета(ТабличныйДокумент, ИмяКартикни);	
	
	РазмерыРиснука = Новый Структура;     
	
	Если Рисунок <> Неопределено Тогда
		РазмерыРиснука.Вставить("Ширина", Рисунок.Ширина);
		РазмерыРиснука.Вставить("Высота", Рисунок.Высота);
	КонецЕсли;
	
	Возврат РазмерыРиснука;
	
КонецФункции

Функция ПолучитьСхемуКомпоновкиДанных(Знач ТипЗначенияОбъекта) Экспорт
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияОбъекта);
	
	Схема = Справочники.CW_МакросыШаблоновДокументов.ПолучитьМакет("МакетРеквизитов");  
	НаборДанных = Схема.НаборыДанных.Получить(0);
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "//ПолноеИмя", ИдентификаторОбъектаМетаданных.ПолноеИмя); 
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "//Имя", 	    ИдентификаторОбъектаМетаданных.Имя);  
	
	ПолеСсылка = НаборДанных.Поля[0];
	ПолеСсылка.Заголовок = ИдентификаторОбъектаМетаданных.Синоним;
	
	Возврат Схема;

КонецФункции
